Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: སྤོས་དང་ཕྲེང་བ་དག་དང་བྱུག་པ་དང་། །གོས་དང་ཕྱེ་མ་མེ་ཏོག་སྣ་ཚོགས་དག །ལྗོན་ཤིང་དག་ལས་དུས་གསུམ་འབབ་པར་ཤོག །སེམས་ཅན་དེ་དག་ལེན་ཅིང་དགར་གྱུར་ཅིག །
en: “ ‘May various perfumes, garlands, ointments, Clothes, powders, and flowers Rain down from trees throughout the three times, And may beings obtain them and be made happy.

source: དེ་བཞིན་གཤེགས་པ་བསམ་ཡས་ཐམས་ཅད་དང་། །རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་དང་། །རྡུལ་བྲལ་དྲི་མེད་བརྟན་པའི་ཆོས་ལ་ཡང་། །ཕྱོགས་བཅུ་རྣམས་སུ་མཆོད་པ་བྱེད་པར་ཤོག །
en: “ ‘May they make offerings in the ten directions To all the countless tathāgatas, Perfect bodhisattvas, śrāvakas, And the eternal, spotless, stainless Dharma.

source: འགྲོ་བ་དམན་པ་ཐམས་ཅད་སྤོང་གྱུར་ཅིག །མི་ཁོམ་བརྒྱད་པོ་དག་ལས་འདས་པར་ཤོག །དལ་བའི་རྒྱལ་པོ་དམ་པ་ཐོབ་གྱུར་ཅིག །རྟག་ཏུ་སངས་རྒྱས་འགྲོགས་པ་ཐོབ་པར་ཤོག །
en: “ ‘May they always avoid lower existences, May they transcend the eight unfortunate states, May they attain the king of fortunate states, And may they always reach the presence of the buddhas.

source: རྟག་ཏུ་མཐོན་པོའི་རིགས་སུ་སྐྱེ་བར་ཤོག །
en: “ ‘May they always be born into a high family.

source: ནོར་དང་འབྲུ་ཡི་མཛོད་རྣམས་འབྱོར་གྱུར་ཅིག །
en: May they possess a treasure of wealth and grain.

source: སྙན་དང་གྲགས་དང་གཟུགས་དང་ཁ་དོག་གིས། །བསྐལ་པ་དུ་མར་ལེགས་པར་བརྒྱན་པར་ཤོག །
en: May they be perfectly adorned throughout many eons By fame, renown, and excellent bodies and color.

source: བུད་མེད་ཐམས་ཅད་རྟག་ཏུ་ཕོར་གྱུར་ཏེ། །དཔའ་ཞིང་རྟུལ་ཕོད་མཁས་ཤིང་གསལ་བར་ཤོག །དེ་ཀུན་རྟག་ཏུ་བྱང་ཆུབ་ཕྱིར་སྤྱོད་གྱུར། །
en: “ ‘May all women always be males, Who are heroic, courageous, and wise.

source: ཕ་རོལ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པར་ཤོག །
en: May they all practice for the sake of enlightenment And may they practice the six perfections.

source: ཕྱོགས་བཅུ་དག་ན་རིན་ཆེན་ཤིང་དབང་དྲུང་། །སངས་རྒྱས་བདེ་བཞུགས་རིན་ཆེན་བཻ་ཌཱུརྱའི། །ཁྲི་ལ་བཞུགས་པ་དག་ནི་མཐོང་གྱུར་ཅིག །ཆོས་བསྟན་པ་ཡང་དེ་དག་ཐོས་པར་ཤོག །
en: “ ‘May they see the buddhas in the ten directions Seated blissfully on thrones of beryl jewels Beneath supreme, precious trees, And may they hear their teaching of the Dharma.

source: བདག་གིས་སྡིག་པའི་ལས་རྣམས་བསྒྲུབས་པ་ནི། །སྲིད་པ་ཉམ་ངར་སྔོན་ཅད་གང་བསྒྲུབས་པ། །སྡིག་ལས་གང་དག་མི་འདོད་འབྲས་ཐོབ་པ། །དེ་དག་ཐམས་ཅད་མ་ལུས་ཟད་གྱུར་ཅིག །
en: “ ‘The bad karma that I have created In perilous lifetimes I previously obtained, And the undesirable results accrued by bad karma, May all of that vanish without any remainder.

source: སེམས་ཅན་གང་དག་སྲིད་པར་བཅིངས་གནས་ཀུན། །འཁོར་བའི་ཞགས་པའི་ཐག་པས་དམ་བཅིངས་པ། །ཤེས་རབ་ལག་གིས་བཅིངས་པ་བཀྲོལ་བར་ཤོག །སྡུག་བསྔལ་རྣམས་ལས་ཐར་གྱུར་ཐོབ་གྱུར་ཅིག །
en: “ ‘All those beings who are in the bondage of existence, Tightly bound by the noose of saṃsāra, May the hands of wisdom untie their bonds, And may they attain freedom from suffering.

source: སེམས་ཅན་གང་དག་འཛམ་བུ་གླིང་འདི་དང་། །གང་དག་འཇིག་རྟེན་ཁམས་ནི་གཞན་རྣམས་ན། །བསོད་ནམས་སྣ་ཚོགས་ཟབ་མོ་རྣམས་བྱེད་པ། །དེ་དག་ཀུན་ལ་རྗེས་སུ་ཡི་རང་ངོ་། །
en: “ ‘I rejoice in the entirety Of the various, profound merits Accomplished by beings in this Jambudvīpa And by those who are in other world realms.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱིས་བསྒྲུབས་པ་ཡི། །བདག་གི་རྗེས་སུ་ཡི་རང་བསོད་ནམས་དེས། །བདག་ནི་སྨོན་གྲུབ་འབྲས་བུ་ཡོད་པར་ཤོག །བྱང་ཆུབ་རྡུལ་བྲལ་བླ་མེད་ཐོབ་གྱུར་ཅིག །
en: “ ‘Through the merit that is created By my rejoicing in body, speech, and mind, May I reach the spotless, highest enlightenment, The result and fulfillment of my prayers.

source: གང་དག་རྟག་དང་དྲི་མ་བྲལ་བ་དང་། །དྲི་མེད་ཡིད་ཀྱིས་ཕྱག་འཚལ་བསྟོད་པ་དང་། །ཡོངས་སུ་བསྔོ་བ་བརྗོད་པ་འདི་ཡིས་ནི། །བསྐལ་པ་དྲུག་ཅུར་ངན་སོང་སྤོང་བར་འགྱུར། །
en: “ ‘Someone who pays homage and praises With a mind that is always clear, pure, and unstained, Will through this recitation of a dedication Avoid the lower realms for sixty eons.

source: ཚིགས་སུ་བཅད་པ་བརྗོད་པ་འདི་དག་གིས། །སྐྱེས་པ་བུད་མེད་བྲམ་ཟེ་རྒྱལ་རིགས་ལས། །ཐལ་སྦྱར་འདུག་སྟེ་རྒྱལ་བ་གང་བསྟོད་པ། །ཚེ་རབས་ཀུན་དུ་སྐྱེ་བ་དྲན་པར་འགྱུར། །
en: “ ‘The men, women, brahmins, and kṣatriyas Who praise the jinas, with palms together in homage, Through the recitation of these verses Will remember their lifetimes in all their lives.

source: ཡན་ལག་དབང་པོ་ཀུན་གྱིས་ཡན་ལག་བརྒྱན། །
en: “ ‘Their limbs will be adorned by all aspects and attributes.

source: བསོད་ནམས་ཡོན་ཏན་སྣ་ཚོགས་རྣམས་དང་ལྡན། །
en: They will be endowed with various merits and qualities.

source: མི་དབང་རྒྱལ་པོས་རྟག་ཏུ་དེ་མཆོད་དེ། །
en: They will be continually offered to by kings, the lords of men.

source: དེ་དང་དེ་དག་ཏུ་ནི་དེ་འདྲར་འགྱུར། །
en: That is what they will be like wherever they are.

source: གང་དག་རྣ་བའི་བུ་གར་བཤགས་པ་འདི་ནི་གྲགས་འགྱུར་བ། །དེ་དག་སངས་རྒྱས་གཅིག་གི་གན་ནས་དགེ་བ་བྱས་མ་ཡིན། །གཉིས་ལ་མ་ཡིན་བཞི་ལ་མ་ཡིན་ལྔ་མིན་བཅུ་ལ་མིན། །དེ་ལྟར་སངས་རྒྱས་སྟོང་གི་གན་ནས་དགེ་བ་བྱས་པ་ཡིན། །
en: “ ‘Those into whose ears the sound of this confession has entered Have not accomplished goodness in the presence of only one buddha, Nor in the presence of only two, or four, or five, or ten, But rather have accomplished goodness in the presence of a thousand buddhas.’ ”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་གསན་ནས། བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: At that time, the Bhagavat, having listened to those verses, said to the bodhisattva Ruciraketu, “Well done!

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱི་རྨི་ལམ་ན། གསེར་གྱི་རྔ་ལས་དེ་བཞིན་གཤེགས་པའི་ཡང་དག་པའི་ཡོན་ཏན་བསྔགས་པ་དང་། སྡིག་པ་བཤགས་པ་འདི་དག་གང་གིས་ཐོས་པ་དེ་དག་ཐམས་ཅད་བསོད་ནམས་ཀྱི་ཕུང་པོ་རྒྱ་ཆེན་པོ་དང་ལྡན་པ་དང་།
en: Noble one, know that all those who hear these praises of the true qualities of the tathāgatas, and the confession of bad actions that came from a golden drum in your dream, possess a vast aggregation of merit.

source: སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། བདེ་བས་ཚིམ་པར་བྱེད་དེ། སྒྲིབ་པ་ཐམས་ཅད་བྱང་བར་འགྱུར་བར་ཤེས་པར་གྱིས་ཤིག །
en: They will benefit many beings, will bring them the satisfaction of happiness, and will be purified of all obscurations.

source: འདི་ལྟ་བུའི་སྤྱོད་པ་ཁྱད་པར་ཅན་དང་ལྡན་པ་འདི་དག་ནི། ཐམས་ཅད་ཀྱང་སྔོན་འདས་པའི་དུས་ན། དེ་བཞིན་གཤེགས་པ་དག་ལ་བསྟོད་པ་དང་། སྨོན་ལམ་རྒྱ་ཆེན་པོ་བཏབ་པའི་རྒྱུ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་དེ་དག་ཐོས་པར་གྱུར་པ་ཡིན་ནོ་ཞེས་བཀའ་སྩལ་ནས།
en: All of these who possess this kind of special conduct have heard those verses because they have previously, in past times, praised the tathāgatas, made vast prayers, and received the blessing of the tathāgatas.”

source: དེ་ནས་འཁོར་འདུས་པ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: The entire gathered assembly then praised the words of the Bhagavat.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། རྨི་ལམ་ན་བཤགས་པའི་ལེའུ་སྟེ་བཞི་པའོ།། །།
en: This concludes “The Confession in a Dream,” the fourth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྣམ་པར་དབྱེ་བ་ལ་བཞུགས་ཏེ། ཤིན་ཏུ་ཟབ་མོ་མཆོག་ཏུ་གྱུར་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་སྐུའི་བ་སྤུའི་བུ་ག་ནས། འོད་ཟེར་ཁ་དོག་རྣམ་པ་སྣ་ཚོགས་བརྒྱ་སྟོང་ཚད་མེད་པ་བྱུང་བས། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་འོད་དེའི་ནང་དུ་སྣང་བར་གྱུར་པ་ནི།
en: Chapter 5: The End of the Continuum of Creating Karma Then the Bhagavat dwelled in correct analysis, and as soon as he rested in that extremely profound, supreme samādhi, from the pores of his body there came many hundreds of thousands of light rays of various colors and all buddha realms were illuminated within that light.

source: ཕྱོགས་བཅུའི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱིས་ཀྱང་དཔེ་དང་ཚད་ཀྱིས་བསྐྲུན་པར་མི་ནུས་སོ། །
en: Their number could not be exemplified or measured even by the number of sand grains in all the Ganges Rivers in the ten directions.

source: སྙིགས་མ་ལྔའི་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་དེས་སྣང་བར་གྱུར་པའི་སེམས་ཅན་དེ་དག་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་། མཚམས་མེད་པ་ལྔ་བྱེད་པ་དང་། དཀོན་མཆོག་གསུམ་ལ་སྐུར་པ་འདེབས་པ་དང་། བླ་མ་དང་གཉེན་པ་ལ་སྲི་ཞུ་ཆུང་བ་དང་། སློབ་དཔོན་དང་། བྲམ་ཟེ་ལ་བཀུར་སྟི་མི་བྱེད་པ་རྣམས། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་།
en: In the world realms with the five degenerations that were illuminated by those light rays, they immediately brought happiness upon touching those who had fallen into existences as hell beings, as animals, and as pretas through following the path of the ten bad actions, committing the five actions with immediate result upon death, maligning the Three Jewels, having disrespect for gurus and family, and dishonoring ācāryas and brahmins.

source: ཡི་དགས་ཀྱི་གནས་སུ་ལྟུང་བར་འགྱུར་བ་དེ་དག་གི་གནས་སུ་འོད་དེས་རེག་མ་ཐག་ཏུ་བདེ་བ་སོ་སོར་མྱོང་བར་གྱུར་ཏོ། །གང་གིས་འོད་དེ་མཐོང་བ་དང་། འོད་དེའི་མཐུས་ཐམས་ཅད་ཀྱང་བདེ་ཞིང་ཉམས་དགའ་བ་དང་། ཁ་དོག་དང་དབྱིབས་ལེགས་པའི་མཆོག་ཐོབ་པས།
en: Whoever saw those light rays, through the power of that light became happy, delighted, and attained a perfectly excellent color and form.

source: མཚན་ཕུན་སུམ་ཚོགས་པ་དང་། བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པས། དེ་བཞིན་གཤེགས་པ་རྣམས་མཐོང་བར་གྱུར་ཏོ། །
en: Adorned by perfect physical signs, and the accumulations of merit and wisdom, they saw the tathāgatas.

source: དེ་ནས་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་ལྷའི་ཚོགས་མང་པོ་དང་། གང་གཱའི་ལྷ་མོ་ལ་སོགས་ཏེ། འཁོར་འདུས་པ་དེ་དག་ཡ་མཚན་དུ་གྱུར་པའི་འོད་དེས་བསྐུལ་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The gathered assembly of Śakra, the lord of devas, the Ganges goddess, and so on, were inspired by that wondrous light and went to where the Bhagavat was.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ། སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས། ལས་ཀྱི་སྒྲིབ་པ་རྣམས་ཇི་ལྟར་སོ་སོར་བཤགས་པར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: When they arrived, they circumambulated the Bhagavat three times and then sat in their various places.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤཱ་རིའི་བུ་འདི་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ། སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་ཚིག་འདི་སྐད་དུ། སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་བདེ་བའི་སླད་དུ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ད་ལྟ་ན།
en: Then Venerable Śāriputra rose from his seat and with his upper robe over one shoulder, he knelt on his right knee, placed his palms together in homage, bowed toward the Bhagavat, and inquired of the Bhagavat, “Bhagavat, how should a noble son or noble daughter who has entered the Śrāvakayāna, or who has entered the Pratyeka­buddha­yāna, or who has entered the Mahāyāna, or any other being who is seeking the highest, most complete enlightenment of buddhahood, confess their individual karmic obscurations?”

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྟོན་པ། ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་འཛིན་པ། ཆོས་ཀྱི་སྦྱིན་པ་རབ་ཏུ་མཛད་པ། ཆོས་ཀྱི་སྒྲོན་མ་རབ་ཏུ་འབར་བར་མཛད་པ། ཆོས་ཀྱི་ཆར་རབ་ཏུ་འབེབས་པ། ཆོས་ཀྱི་རྔ་རབ་ཏུ་རྡུང་བ། ཆོས་ཀྱི་རྔ་བོ་ཆེ་རབ་ཏུ་རྡུང་བ། ཆོས་ཀྱི་དུང་རབ་ཏུ་འབུད་པ། ཆོས་ཀྱི་སྲོག་ཤིང་རབ་ཏུ་སྒྲེང་བ། སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་མཛད་པ། ཉམ་བག་ཏུ་སྤྱོད་དུ་འཇུག་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་བདག་ཕྱག་འཚལ་ལོ།། །།བམ་པོ་གསུམ་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཆོད་པའི་གནས། ཕྱག་བགྱི་བའི་གནས། རི་མོ་བགྱི་བའི་གནས། མཁྱེན་པར་གྱུར་པ། སྤྱན་དུ་གྱུར་པ། དཔང་དུ་གྱུར་པ།
en: After Venerable Śāriputra had asked that, the Bhagavat said these words to him: “Śāriputra, a noble son or noble daughter who has entered the Śrāvakayāna, or who has entered the Pratyeka­buddha­yāna, or who has entered the Mahāyāna, or any other being who wishes for the highest, most complete enlightenment of buddhahood, should three times each day and three times each night, with the upper robe over one shoulder, kneel on the right knee, place their palms together in homage, and say these words: “ ‘For the benefit of many beings, for the happiness of many beings, out of compassion for the world, and for the benefit and healing and happiness of the multitudes of beings, devas and humans, I pay homage to the buddha bhagavats who in this present time have attained the highest, most complete enlightenment of buddhahood in worlds in the ten directions, those buddha bhagavats who conscientiously turn the wheel of the Dharma, teach the wheel of the Dharma, possess the way of the Dharma, give the gift of the Dharma, light the lamp of the Dharma, send down the rain of the Dharma, beat the drum of the Dharma, beat the great drum of the Dharma, blow the conch of the Dharma, raise the central pillar of the Dharma, and bring satisfaction to all beings with the gift of the Dharma.

source: ཚད་མར་གྱུར་པ། མཁྱེན་པ་དང་ལྡན་པ། གཟིགས་པ་དང་ལྡན་པ་དེ་དག་ལ། བདག་མགོ་དང་། ངག་དང་ཡིད་ཀྱིས་ཕྱག་འཚལ་ལོ། །
en: “ ‘I pay homage with my head, voice, and mind to those who are the object of offering, the object of homage, and the object of respect, and who are wise, who are attentive, who are witnesses, who are valid, who have wisdom, and who have vision.

source: ཐོག་མ་དང་ཐ་མ་མ་མཆིས་པའི་འཁོར་བ་ན་འཁོར་བའི་ཚེ། བདག་འདོད་ཆགས་ཀྱིས་གཟིར་བའམ། ཞེ་སྡང་གིས་གཟིར་བའམ། གཏི་མུག་གིས་གཟིར་བའི་ལུས་དང་། ངག་དང་ཡིད་ཀྱིས་ལས་ཀྱི་སྒྲིབ་པ་གང་མངོན་པར་འདུས་བགྱིས་པ།
en: “ ‘While I have been circling in beginningless and endless saṃsāra, tormented by desire, tormented by anger, and tormented by stupidity, I have accumulated karmic obstructions with my body, speech, and mind.

source: སངས་རྒྱས་སུ་མ་འཚལ་བ་དང་། ཆོས་སུ་མ་འཚལ་བ་དང་། དགེ་འདུན་དུ་མ་འཚལ་བ་དང་།
en: I have not acknowledged the Buddha, I have not acknowledged the Dharma, and I have not acknowledged the Saṅgha.

source: དགེ་བ་དང་མི་དགེ་བར་མ་འཚལ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་ངན་སེམས་ཀྱིས་ཁྲག་ཕྱུང་བ་དང་།
en: I have not acknowledged what are good actions and what are bad ones.

source: ཆོས་སྤངས་པ་དང་། དགེ་འདུན་གྱི་དབྱེན་བགྱིས་པ་དང་། དགེ་སློང་དགྲ་བཅོམ་པ་བཀུམ་པ་དང་། ཕ་མ་བཀུམ་པ་དང་། ལུས་ཀྱི་རྣམ་པ་གསུམ། ངག་གི་རྣམ་པ་བཞི། ཡིད་ཀྱི་རྣམ་པ་གསུམ་སྟེ། མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་བགྱིས་པ་དང་།
en: With malicious intent, I have caused a tathāgata to bleed, I have forsaken the Dharma, I have caused a division of the Saṅgha, I have slain a bhikṣu arhat, I have slain my parents, and I have followed the path of the ten bad actions—the three physical, the four verbal, and the three mental.

source: བགྱིད་དུ་སྩལ་བ་དང་། བགྱིད་པ་ལ་རྗེས་སུ་ཡི་རང་བ་དང་། སེམས་ཅན་ཁ་ཅིག་ལ་ངག་རྩུབ་པོ་སྨྲས་པ་དང་།
en: I have made others commit them, I have rejoiced in their accomplishment, and I have spoken harshly to certain beings.

source: སྐུར་པ་བཏབ་པ་དང་།
en: I have maligned.

source: སྲང་ལ་གཡོ་བགྱིས་པ་དང་།
en: I have cheated with weights.

source: གཞལ་བ་ལ་གཡོ་བགྱིས་པ་དང་། འགྲོ་བ་དྲུག་ཏུ་འཁོར་བར་འཁོར་བ་ན།
en: I have cheated with measures.

source: ཕ་མ་མི་དགའ་བར་བགྱིས་པ་དང་།
en: I have made my parents unhappy.

source: གང་ཟག་གིའམ། མཆོད་རྟེན་གྱིའམ། དགེ་འདུན་གྱིའམ། ཕྱོགས་བཞིའི་དགེ་སློང་གི་དགེ་འདུན་གྱི་ནོར་བརྐུས་པ་དང་།
en: I have stolen the wealth of individuals, of stūpas, of saṅghas, and of the saṅghas of bhikṣus in the four directions.

source: ཇི་ལྟར་བསླབ་པའི་གཞི་བཅས་པ་རྣམས་ཀྱི་འདུལ་བ་དང་། འགལ་བར་བགྱིས་པ་དང་། མཁན་པོ་དང་།
en: I have transgressed the vinaya and the foundations of the training.

source: སློབ་དཔོན་གྱིས་བསྒོ་བ་མ་མཉན་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ།
en: I have disobeyed the upādhyāyas and the ācāryas.

source: དེ་ལས་གཞན་པའི་སེམས་ཅན་རྣམས་ལ་མི་སྙན་པ་བགྱིས་པ་དང་། སྤྱོས་པ་དང་། བརྡེགས་པ་དང་། དེ་དག་ལ་ཐ་བ་དང་། ཞེ་སྡང་བསྐྱེད་པ་དང་། ཕྲག་དོག་དང་། སེར་སྣ་ལས་བྱུང་བའི་སེམས་ཀྱིས།
en: I have been unpleasant to those who have entered the Śrāvakayāna, entered the Pratyeka­buddha­yāna, entered the Mahāyāna, and every other being—I have reviled and beaten them with a mind that is obstinate, angry, envious, and miserly.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པ་དང་། དམ་པའི་ཆོས་ལ་ཆོས་མ་ལགས་ཞེས་བགྱིས་པ་དང་། ཆོས་མ་ལགས་པ་ལ། དམ་པའི་ཆོས་ལགས་ཞེས་བགྱིས་པ་དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཁྱེན་པར་གྱུར་པ། སྤྱན་དུ་གྱུར་པ།
en: I have spoken harsh words to buddha bhagavats, have said that the sublime Dharma is not the Dharma, and have said that that which is not the Dharma is the sublime Dharma.

source: དཔང་དུ་གྱུར་པ། ཚད་མར་གྱུར་པ། མཁྱེན་པ་དང་ལྡན་པ། གཟིགས་པ་དང་ལྡན་པ། དེ་དག་གི་སྤྱན་སྔར་སོ་སོར་འཆགས་སོ། །
en: “ ‘All of this I individually confess in the presence of the buddha bhagavats, who are wise, who are attentive, who are witnesses, who are valid, who have wisdom, and who have vision.

source: མཐོལ་ལོ་མི་འཆབ་བོ། །སླན་ཅད་ཀྱང་མི་བགྱིད་དོ། །བདག་ལས་ཀྱི་སྒྲིབ་པ་གང་གིས་བསྒྲིབས་ཏེ། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། ཡི་དགས་ཀྱི་ཡུལ་དང་། ལྷ་མ་ཡིན་གྱི་ཚོགས་ཀྱི་ནང་དུ་མཆི་བར་འགྱུར་བ་དང་།
en: I repent them, I do not conceal them, and I will not repeat them.

source: སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་མཉེས་པར་བགྱིད་པར་མི་འགྱུར་བ་དང་། མི་ཁོམ་པ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་བའི་ལས་དེ་ལུས་འདི་ཉིད་ལ་རྣམ་པར་སྨིན་ཏེ། གཞན་དུ་མི་མྱོང་བར་ཤོག་ཅིག །
en: “ ‘Whatever karmic obscurations obscure me—those that will cause me to be in the hell realms, in the life of an animal, or in the land of the pretas; to be among the hosts of asuras; to not be able to please the Buddha, Dharma, and Saṅgha; and to be born in other unfortunate existences—that karma will ripen in this body and will not be experienced by anyone else.

source: དེ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཁྱེན་པར་གྱུར་པ། སྤྱན་དུ་གྱུར་པ། དཔང་དུ་གྱུར་པ། ཚད་མར་གྱུར་པ། མཁྱེན་པ་དང་ལྡན་པ། གཟིགས་པ་དང་ལྡན་པ་དེ་དག་གི་སྤྱན་སྔར་སོ་སོར་འཆགས་སོ། །
en: I confess each one in the presence of the buddha bhagavats, who are wise, who are attentive, who are witnesses, who are valid, who have wisdom, and who have vision.

source: མཐོལ་ལོ་མི་འཆབ་པོ་སླན་ཅད་ཀྱང་མི་བགྱིད་དོ། །
en: I repent them, I do not conceal them, and I will not repeat them.

source: ཇི་ལྟར་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་སྔོན་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན། ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པ་དང་། མ་བཅབས་པ་དེ་བཞིན་དུ་བདག་ཀྱང་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་འཆགས་སོ། །མཐོལ་ལོ་མི་འཆབ་བོ། སླན་ཅད་ཀྱང་མི་བགྱིད་དོ། །
en: “ ‘Just as the bodhisattva mahāsattvas of the past, in practicing for enlightenment, confessed each of their karmic obscurations, repenting them and not concealing them, in the same way I confess each one of my karmic obscurations, repent them, do not conceal them, and will not repeat them.

source: ཇི་ལྟར་མ་འོངས་པའི་དུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་འཆགས་པར་འགྱུར་བ་དང་། མི་འཆབ་པར་འགྱུར་བ་དེ་བཞིན་དུ། བདག་ཀྱང་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་འཆགས་སོ། །མཐོལ་ལོ་མི་འཆབ་བོ། སླན་ཅད་ཀྱང་མི་བགྱིད་དོ། །
en: “ ‘Just as the bodhisattva mahāsattvas in the future, in practicing for enlightenment, will confess each of their karmic obscurations, repent them, and not conceal them, in the same way I confess each one of my karmic obscurations, repent them, do not conceal them, and will not repeat them.

source: ཇི་ལྟར་ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན། ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་འཆགས་པ་དང་། མི་འཆབ་པ་དེ་བཞིན་དུ། བདག་ཀྱང་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་འཆགས་སོ། །མཐོལ་ལོ་མི་འཆབ་བོ། །སླན་ཅད་ཀྱང་མི་བགྱིད་དོ། །
en: “ ‘Just as the bodhisattva mahāsattvas in the ten directions in the present, in practicing for enlightenment, confess each of their karmic obscurations, repent them, and do not conceal them, in the same way I confess each one of my karmic obscurations, repent them, do not conceal them, and will not repeat them.

source: ཇི་ལྟར་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པ་དང་། སོ་སོར་འཆགས་པ་དང་། སོ་སོར་འཆགས་པར་འགྱུར་བ་དེ་བཞིན་དུ། བདག་ཀྱང་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་འཆགས་སོ། །མཐོལ་ལོ་མི་འཆབ་བོ། སླན་ཅད་ཀྱང་མི་བགྱིད་དོ། །ཞེས་བརྗོད་པར་བྱའོ། །
en: “ ‘Just as the bodhisattva mahāsattvas of the past, the future, and the present, in practicing for enlightenment, confess each of their karmic obscurations, repent them, and do not conceal them, in the same way I confess each one of my karmic obscurations, repent them, do not conceal them, and will not repeat them.’

source: ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པ་རྣམ་པར་དག་པ་ཐོབ་པར་འདོད་པས། འདི་བཞིན་དུ་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པར་བྱའོ། །མི་བཅབ་པར་བྱའོ། །ཕྱིན་ཅད་ཀྱང་མི་བྱའོ། །སུ་རྒྱལ་རིགས་ཀྱི་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཕྱུག་པ་ནོར་ཆེ་བ། ལོངས་སྤྱོད་ཆེ་བ།
en: “Thus, Śāriputra, a noble son or noble daughter who wishes to attain purity and absence of obscuration in all Dharmas should in that way confess their individual karmic obscurations, not conceal them, and state that they will not repeat them.

source: ས་ལེ་སྦྲམ་དང་། ནོར་དང་། ཡོ་བྱད་མང་བ། ཤིན་ཏུ་སྐྱིད་པ། བཞོན་པ་ཆེན་པོ་ལ་ཞོན་པ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འདོད་པ་དེས་ཀྱང་འདི་བཞིན་དུ་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པར་བྱའོ། །མི་བཅབ་པར་བྱའོ། །ཕྱིན་ཅད་ཀྱང་མི་བྱའོ། །སུ་བྲམ་ཟེའི་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་རྣམས་དང་། ཁྱིམ་བདག་གི་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཕྱུག་པ། ནོར་ཆེ་བ། ལོངས་སྤྱོད་ཆེ་བ།
en: “Those who wish to be reborn like a great sal tree among the kṣatriyas, rich, with great wealth—with great possessions, with gold, with herds, with many requisites, very happy, and riding in a great carriage—should also in this way confess their individual karmic obscurations, not conceal them, and state that they will not repeat them.

source: ས་ལེ་སྦྲམ་དང་། ནོར་དང་། ཡོ་བྱད་མང་བ། ཤིན་ཏུ་སྐྱིད་པ། བཞོན་པ་ཆེན་པོ་ལ་ཞོན་པ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འདོད་པ་དེས་ཀྱང་འདི་བཞིན་དུ། ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པར་བྱའོ། །མི་བཅབ་པར་བྱའོ། །ཕྱིན་ཅད་ཀྱང་མི་བྱའོ། །
en: “Those who wish to be reborn like a great sal tree among the brahmins, in a family that is rich, with great wealth—great possessions, gold, herds, many requisites, very happy, and riding in a great carriage—should also in this way confess their individual karmic obscurations, not conceal them, and state that they will not repeat them.

source: སུ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་བརྟུལ་ཞུགས་དང་། མཚུངས་པར་སྐྱེ་བར་འདོད་པ་དེས་ཀྱང་འདི་བཞིན་དུ་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པར་བྱའོ། །མི་བཅབ་པར་བྱའོ། །ཕྱིན་ཅད་ཀྱང་མི་བྱའོ། །
en: “Those who wish to be reborn into the same way of life as that of the devas of the Cāturmahā­rāja­kāyika should in this way confess their individual karmic obscurations, not conceal them, and state that they will not repeat them.

source: སུ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་བརྟུལ་ཞུགས་དང་། མཚུངས་པར་སྐྱེ་བར་འདོད་པ་དེས་ཀྱང་འདི་བཞིན་དུ་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པར་བྱའོ། །མི་བཅབ་པར་བྱའོ། །ཕྱིན་ཅད་ཀྱང་མི་བྱའོ། །དེ་བཞིན་དུ་སུ་འཐབ་བྲལ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། །ཚངས་རིས་དང་། ཚངས་པའི་མདུན་ན་འདོན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། འོད་ཆུང་དང་། ཚད་མེད་འོད་དང་། འོད་གསལ་དང་། དགེ་ཆུང་དང་། ཚད་མེད་དགེ་དང་། དགེ་རྒྱས་དང་། སྤྲིན་མེད་དང་། བསོད་ནམས་སྐྱེས་དང་། འབྲས་བུ་ཆེ་དང་། སེམས་ཅན་འདུ་ཤེས་མེད་པ་དང་། གྱ་ནོམ་སྣང་བ་དང་།
en: “Those who wish to be reborn among the devas of Trāyastriṃśa, with their same quality of life, should in this way confess their individual karmic obscurations, not conceal them, and state that they will not repeat them.
